Картотека1/src/Catalogs/трс_НедвижимоеИмущество/трс_НедвижимоеИмущество.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>трс_НедвижимоеИмущество</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ОбъектКапитальногоСтроительства</name>
      <description>Объект капитального строительства</description>
    </items>
    <items>
      <name>ЗемельныйУчасток</name>
      <description>Земельный участок</description>
    </items>
  </predefined>
  <attributes>
    <name>УчетныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНедвижимости</name>
    <type>
      <types>EnumRef.трс_ТипНедвижимости</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмерениеПлощади</name>
    <type>
      <types>EnumRef.трс_ИзмерениеПлощади</types>
    </type>
  </attributes>
  <attributes>
    <name>Площадь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Этажность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредКадастровыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПрава</name>
    <type>
      <types>EnumRef.трс_ВидПрава</types>
    </type>
  </attributes>
  <attributes>
    <name>КонецАренды</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КадастроваяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбъекта</name>
    <type>
      <types>EnumRef.трс_ВидОбъекта</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦелевоеИспользование</name>
    <type>
      <types>EnumRef.трс_ВидЦелевогоИспользованияЗдания</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>EnumRef.трс_ВидНазначения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеЗдания</name>
    <type>
      <types>EnumRef.трс_ВидИспользованияЗдания</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияЗемель</name>
    <type>
      <types>EnumRef.трс_ВидКатегорииЗемель</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойДокумент</name>
    <comment>Основной документ, хранящий информацию об объекте, как паспорт</comment>
    <type>
      <types>CatalogRef.трс_ВыпискаИзЕГРН</types>
      <types>CatalogRef.трс_СвидетельствоНаПравоСобственности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>CatalogRef.трс_ДоговорАренды</types>
      <types>CatalogRef.трс_СвидетельствоОНаследстве</types>
      <types>CatalogRef.трс_РазрешениеНаВводВЭксплуатацию</types>
      <types>CatalogRef.трс_ДоговорДолевогоУчастия</types>
      <types>CatalogRef.трс_ДоговорДарения</types>
      <types>CatalogRef.трс_ДоговорМены</types>
      <types>CatalogRef.трс_ДоговорСубаренды</types>
      <types>CatalogRef.трс_ДоговорКуплиПродажи</types>
    </type>
  </attributes>
  <attributes>
    <name>АктПриемаПередачи</name>
    <type>
      <types>CatalogRef.трс_АктПриемаПередачи</types>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоНаПравоСобственности</name>
    <type>
      <types>CatalogRef.трс_СвидетельствоНаПравоСобственности</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловныйКадастровыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерГосРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаГосРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Правообладатель</name>
    <type>
      <types>CatalogRef.трс_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КадастровыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗемельныйУчасток</name>
    <type>
      <types>CatalogRef.трс_НедвижимоеИмущество</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРазрешенногоИспользования</name>
    <type>
      <types>CatalogRef.трс_ВидыРазрешенногоИспользования</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодЗавершенияСтроительства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НедвижимостьЛиквидирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоседниеОбъекты</name>
    <attributes>
      <name>КадастровыйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрикрепленныеФайлы</name>
    <attributes>
      <name>ПрикрепленныйДокумент</name>
      <type>
        <types>CatalogRef.трс_ФайловыйДокумент</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументКомментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДругиеКадастровыеНомера</name>
    <attributes>
      <name>КадастровыйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОсновныеДокументы</name>
    <attributes>
      <name>ОсновнойДок</name>
      <type>
        <types>CatalogRef.трс_ДоговорЗалога</types>
        <types>CatalogRef.трс_ДоговорАренды</types>
        <types>CatalogRef.трс_АктПриемаПередачи</types>
        <types>CatalogRef.трс_ТехническийПлан</types>
        <types>CatalogRef.трс_ВыпискаИзЕГРН</types>
        <types>CatalogRef.трс_СвидетельствоНаПравоСобственности</types>
        <types>CatalogRef.трс_ДоговорДолевогоУчастия</types>
        <types>CatalogRef.трс_ДоговорДарения</types>
        <types>CatalogRef.трс_ДоговорМены</types>
        <types>CatalogRef.трс_ДоговорСубаренды</types>
        <types>CatalogRef.трс_ДоговорКуплиПродажи</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлощадьПоДокументу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументКомментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеДокументы</name>
    <attributes>
      <name>ДополнительныйДок</name>
      <type>
        <types>CatalogRef.трс_СитуационныйПлан</types>
        <types>CatalogRef.трс_ПисьмоОрганов</types>
        <types>CatalogRef.трс_СхемаРазмещения</types>
        <types>CatalogRef.трс_Декларация</types>
        <types>CatalogRef.трс_СправкаОКадастровойСтоимости</types>
        <types>CatalogRef.трс_Справка</types>
        <types>CatalogRef.трс_УведомлениеОЗавершенииСтроительства</types>
        <types>CatalogRef.трс_КадастровыйПаспорт</types>
        <types>CatalogRef.трс_УведомлениеОНачалеСтроительства</types>
        <types>CatalogRef.трс_СвидетельствоОНаследстве</types>
        <types>CatalogRef.трс_РазрешениеНаВводВЭксплуатацию</types>
        <types>CatalogRef.трс_РешениеСобственникаОРазделе</types>
        <types>CatalogRef.трс_ТехническийПаспорт</types>
        <types>CatalogRef.трс_ВыпискаИзИСОГД</types>
        <types>CatalogRef.трс_ПроектРеконструкции</types>
        <types>CatalogRef.трс_МежевойПлан</types>
        <types>CatalogRef.трс_ДополнительноеСоглашение</types>
        <types>CatalogRef.трс_СоглашенияОбУступкеПрав</types>
        <types>CatalogRef.трс_ТехническоеЗаключение</types>
        <types>CatalogRef.трс_ПостановлениеОПредоставленииЗемельногоУчастка</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлощадьПоДокументу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументКомментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Картотека1/src/Enums/трс_ТипНедвижимости/трс_ТипНедвижимости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>трс_ТипНедвижимости</name>
  <enumValues>
    <name>ОбъектКапитальногоСтроительства</name>
  </enumValues>
  <enumValues>
    <name>ЗемельныйУчасток</name>
  </enumValues>
</mdclass:Enum>

Картотека1/src/Enums/трс_ВидПрава/трс_ВидПрава.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>трс_ВидПрава</name>
  <enumValues>
    <name>Собственность</name>
  </enumValues>
  <enumValues>
    <name>ДолеваяСобственность</name>
  </enumValues>
  <enumValues>
    <name>Аренда</name>
  </enumValues>
  <enumValues>
    <name>Субаренда</name>
  </enumValues>
  <enumValues>
    <name>Сервитут</name>
  </enumValues>
  <enumValues>
    <name>Ипотека</name>
  </enumValues>
  <enumValues>
    <name>Иное</name>
  </enumValues>
</mdclass:Enum>

Картотека1/src/Enums/трс_ВидОбъекта/трс_ВидОбъекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>трс_ВидОбъекта</name>
  <enumValues>
    <name>ЗемельныйУчасток</name>
  </enumValues>
  <enumValues>
    <name>ЧастьЗемельногоУчастка</name>
  </enumValues>
  <enumValues>
    <name>Здание</name>
  </enumValues>
  <enumValues>
    <name>Сооружение</name>
  </enumValues>
  <enumValues>
    <name>Помещение</name>
  </enumValues>
  <enumValues>
    <name>Квартира</name>
  </enumValues>
  <enumValues>
    <name>ОбъектНезавершенногоСтроительства</name>
  </enumValues>
  <enumValues>
    <name>Иное</name>
  </enumValues>
</mdclass:Enum>

Картотека1/src/Catalogs/трс_НедвижимоеИмущество/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	АктивацияПоТипу();
	АктивацияАренды();
	ЗаполнениеПлощадиПоДокументам();
	ЗаполнитьДокументКомментарийВТабличныхЧастях();
	УстановитьУсловноеОформлениеДокументов();
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.Ссылка.Пустая() Тогда 
		Возврат; 
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("КомментарийКВерсии") Тогда
		Возврат;
	КонецЕсли;

	Отказ = Истина;

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрыЗаписи", ПараметрыЗаписи);

	Оповещение = Новый ОписаниеОповещения("ПередЗаписьюПослеВводаКомментария", ЭтотОбъект, ДополнительныеПараметры);

	ПоказатьВводСтроки(Оповещение, "", НСтр("ru = 'Укажите причину изменений объекта'"), 0, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюПослеВводаКомментария(ВведенноеЗначение, ДополнительныеПараметры) Экспорт

	Если ВведенноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(СокрЛП(ВведенноеЗначение)) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Комментарий обязателен для сохранения изменений.'"));
		Возврат;
	КонецЕсли;

	ДополнительныеПараметры.ПараметрыЗаписи.Вставить("КомментарийКВерсии", ВведенноеЗначение);
	Записать(ДополнительныеПараметры.ПараметрыЗаписи);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если ПараметрыЗаписи.Свойство("КомментарийКВерсии") Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить(
			"ВерсионированиеОбъектовКомментарийКВерсии",
			ПараметрыЗаписи.КомментарийКВерсии);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	УстановитьУсловноеОформлениеДокументов();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидПраваПриИзменении(Элемент)

	АктивацияАренды();

КонецПроцедуры

&НаКлиенте
Процедура ТипНедвижимостиПриИзменении(Элемент)

	АктивацияПоТипу();

КонецПроцедуры

&НаКлиенте
Процедура ДатаГосРегистрацииПриИзменении(Элемент)

	// Зарезервировано под включение активации свидетельства.

КонецПроцедуры

&НаКлиенте
Процедура ВидОбъектаПриИзменении(Элемент)

	ОпределитьТипНедвижимости();
	АктивацияПоТипу();

КонецПроцедуры

&НаКлиенте
Процедура КадастровыйНомерПриИзменении(Элемент)

	КадастровыйНомерПриИзмененииНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОсновныеДокументы

&НаКлиенте
Процедура ОсновныеДокументыПриИзменении(Элемент)

	ПоследняяВыписка = ВзятьПоследнийСвидетельствоИлиЕГРН();
	ЗаполнитьОсновноеИзВыпискиЕГРН(ПоследняяВыписка);
	ОпределитьТипНедвижимости();
	АктивацияАренды();
	АктивацияПоТипу();
	ЗаполнениеПлощадиПоДокументам();
	ЗаполнитьДокументКомментарийВТабличныхЧастях();
	УстановитьУсловноеОформлениеДокументов();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДополнительныеДокументы

&НаКлиенте
Процедура ДополнительныеДокументыПриИзменении(Элемент)

	ЗаполнениеПлощадиПоДокументам();
	ЗаполнитьДокументКомментарийВТабличныхЧастях();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыборЗУ(Команда)

	ОтборДляФормы = Новый Структура;
	ОтборДляФормы.Вставить("ТипНедвижимости", ПолучитьТипЗУ());
	ПараметрыФормы = Новый Структура("Отбор", ОтборДляФормы);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииВыбораЗУ", ЭтотОбъект);
	ОткрытьФорму("Справочник.трс_НедвижимоеИмущество.ФормаВыбора", ПараметрыФормы, ЭтотОбъект, , , , ОбработкаВыбора);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДополнительныйДокумент(Команда)

	ТекущиеДанные = Элементы.ДополнительныеДокументы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ТекущиеДанные.ДополнительныйДок) Тогда
		Возврат;
	КонецЕсли;
	ПоказатьЗначение(, ТекущиеДанные.ДополнительныйДок);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОсновнойДокумент(Команда)

	ТекущиеДанные = Элементы.ОсновныеДокументы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ТекущиеДанные.ОсновнойДок) Тогда
		Возврат;
	КонецЕсли;
	ПоказатьЗначение(, ТекущиеДанные.ОсновнойДок);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПрикрепленныйФайл(Команда)

	ТекущиеДанные = Элементы.ЗакрепленныеДокументы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ТекущиеДанные["ПрикрепленныйДокумент"]) Тогда
		Возврат;
	КонецЕсли;
	ПоказатьЗначение(, ТекущиеДанные["ПрикрепленныйДокумент"]);

КонецПроцедуры

&НаКлиенте
Процедура ПреобразоватьОбъект(Команда)

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПоказатьПредупреждение(, "Сначала запишите объект недвижимости.");
		Возврат;
	КонецЕсли;

	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ВыбывающийОбъект", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ОткрытьФорму("Документ.трс_ВыбытиеОбъекта.Форма.ФормаДокумента", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНедвижимостьПоКН(Команда)

	ТекущиеДанные = Элементы.СоседниеОбъекты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ТекущиеДанные["КадастровыйНомер"]) Тогда
		Возврат;
	КонецЕсли;
	СсылкаНаОбъект = ОткрытьНедвижимостьПоКННаСервере(ТекущиеДанные["КадастровыйНомер"]);
	Если СсылкаНаОбъект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПоказатьЗначение(, СсылкаНаОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриЗакрытииВыбораЗУ(ВыбранноеЗначение, ИсточникВыбора) Экспорт

	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Объект.ЗемельныйУчасток = ВыбранноеЗначение;
	Элементы.ВыборЗУ.Видимость = Ложь;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТипЗУ()

	Возврат Перечисления.трс_ТипНедвижимости.ЗемельныйУчасток;

КонецФункции

&НаСервере
Процедура АктивацияАренды()

	Аренда = Перечисления.трс_ВидПрава.Аренда;
	Субаренда = Перечисления.трс_ВидПрава.Субаренда;
	Если Объект.ВидПрава = Аренда ИЛИ Объект.ВидПрава = Субаренда Тогда
		Элементы.КонецАренды.Видимость = Истина;
	Иначе
		Элементы.КонецАренды.Видимость = Ложь;
		Объект.КонецАренды = "";
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура АктивацияПоТипу()

	ОКС = Перечисления.трс_ТипНедвижимости.ОбъектКапитальногоСтроительства;
	ЕстьОКС = (Объект.ТипНедвижимости = ОКС);
	ЕстьЗУ = НЕ ЕстьОКС;

	Элементы.ГруппаЗУ.Видимость = ЕстьОКС;
	Элементы.ИспользованиеЗдания.Видимость = ЕстьОКС;
	Элементы.ЦелевоеИспользование.Видимость = ЕстьОКС;
	Элементы.Назначение.Видимость = ЕстьОКС;
	Элементы.ГодЗавершенияСтроительства.Видимость = ЕстьОКС;
	Элементы.Этажность.Видимость = ЕстьОКС;

	Если ЕстьОКС Тогда
		Объект.КатегорияЗемель = Неопределено;
		Элементы.ВыборЗУ.Видимость = НЕ ЗначениеЗаполнено(Объект.ЗемельныйУчасток);
		Объект.Родитель = Справочники.трс_НедвижимоеИмущество.ОбъектКапитальногоСтроительства;
	КонецЕсли;

	Элементы.КатегорияЗемель.Видимость = ЕстьЗУ;

	Если ЕстьЗУ Тогда
		Объект.ЗемельныйУчасток = Неопределено;
		Объект.ИспользованиеЗдания = Неопределено;
		Объект.Родитель = Справочники.трс_НедвижимоеИмущество.ЗемельныйУчасток;
		Объект.ГодЗавершенияСтроительства = Неопределено;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОпределитьТипНедвижимости()

	Если НЕ ЗначениеЗаполнено(Объект.ВидОбъекта) Тогда
		Возврат;
	КонецЕсли;

	ВидыОбъекта = Перечисления.трс_ВидОбъекта;
	Если Объект.ВидОбъекта = ВидыОбъекта.ЗемельныйУчасток
		ИЛИ Объект.ВидОбъекта = ВидыОбъекта.ЧастьЗемельногоУчастка Тогда
		Объект.ТипНедвижимости = Перечисления.трс_ТипНедвижимости.ЗемельныйУчасток;
	Иначе
		Объект.ТипНедвижимости = Перечисления.трс_ТипНедвижимости.ОбъектКапитальногоСтроительства;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОсновноеИзВыпискиЕГРН(ВыпискаИзЕГРН)

	Если НЕ ЗначениеЗаполнено(ВыпискаИзЕГРН) Тогда
		Возврат;
	КонецЕсли;

	РеквизитыДляКопирования = "ТипНедвижимости, ИзмерениеПлощади, Площадь, Этажность, Адрес,
		|ПредКадастровыйНомер, ВидПрава, КонецАренды, КадастроваяСтоимость, ВидОбъекта,
		|ЦелевоеИспользование, Назначение, ИспользованиеЗдания, КатегорияЗемель,
		|УсловныйКадастровыйНомер, НомерГосРегистрации, ДатаГосРегистрации, Правообладатель,
		|КадастровыйНомер, ВидРазрешенногоИспользования, УчетныйНомер, ГодЗавершенияСтроительства";

	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВыпискаИзЕГРН, РеквизитыДляКопирования);

	Для Каждого КлючЗначение Из ЗначенияРеквизитов Цикл
		Объект[КлючЗначение.Ключ] = КлючЗначение.Значение;
	КонецЦикла;

	Объект.ОсновнойДокумент = ВыпискаИзЕГРН;
	ЗаполнитьСписокДокументовОснований(ВыпискаИзЕГРН);

КонецПроцедуры

&НаСервере
Функция ВзятьПоследнийСвидетельствоИлиЕГРН()

	РезультатФункции = Неопределено;
	ПоследняяДата = '00010101';

	ОписанияТипов = Новый Массив;
	ОписанияТипов.Добавить(Тип("СправочникСсылка.трс_ВыпискаИзЕГРН"));
	ОписанияТипов.Добавить(Тип("СправочникСсылка.трс_СвидетельствоНаПравоСобственности"));

	Для Каждого Строка Из Объект.ОсновныеДокументы Цикл
		Если НЕ ЗначениеЗаполнено(Строка.ОсновнойДок)
			ИЛИ ОписанияТипов.Найти(ТипЗнч(Строка.ОсновнойДок)) = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		РеквизитыСсылки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Строка.ОсновнойДок, "трс_ДатаВыдачи");
		ДатаВыдачи = РеквизитыСсылки.трс_ДатаВыдачи;
		Если ДатаВыдачи > ПоследняяДата Тогда
			ПоследняяДата = ДатаВыдачи;
			РезультатФункции = Строка.ОсновнойДок;
		КонецЕсли;
	КонецЦикла;

	Возврат РезультатФункции;

КонецФункции

&НаСервере
Процедура ЗаполнениеПлощадиПоДокументам()

	ЗаполнитьПлощадьПоТаблице(Объект.ОсновныеДокументы, "ОсновнойДок");
	ЗаполнитьПлощадьПоТаблице(Объект.ДополнительныеДокументы, "ДополнительныйДок");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПлощадьПоТаблице(ТабличнаяЧасть, ИмяКолонкиДокумента)

	Для Каждого Строка Из ТабличнаяЧасть Цикл
		Документ = Строка[ИмяКолонкиДокумента];
		Если НЕ ЗначениеЗаполнено(Документ) Тогда
			Продолжить;
		КонецЕсли;
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, "Площадь");
		Если ЗначениеЗаполнено(РеквизитыДокумента.Площадь) Тогда
			Строка.ПлощадьПоДокументу = РеквизитыДокумента.Площадь;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументКомментарийВТабличныхЧастях()

	ЗаполнитьКомментарийПоТаблице(Объект.ПрикрепленныеФайлы, "ПрикрепленныйДокумент");
	ЗаполнитьКомментарийПоТаблице(Объект.ОсновныеДокументы, "ОсновнойДок");
	ЗаполнитьКомментарийПоТаблице(Объект.ДополнительныеДокументы, "ДополнительныйДок");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКомментарийПоТаблице(ТабличнаяЧасть, ИмяКолонкиДокумента)

	Для Каждого Строка Из ТабличнаяЧасть Цикл
		Документ = Строка[ИмяКолонкиДокумента];
		Если НЕ ЗначениеЗаполнено(Документ) Тогда
			Продолжить;
		КонецЕсли;
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, "трс_Комментарий");
		Комментарий = РеквизитыДокумента.трс_Комментарий;
		Если ЗначениеЗаполнено(Комментарий) Тогда
			Строка.ДокументКомментарий = Комментарий;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДокументовОснований(ОсновнойДокумент)

	СписокДокументовОснований.Очистить();
	Если НЕ ЗначениеЗаполнено(ОсновнойДокумент) Тогда
		Возврат;
	КонецЕсли;

	Для Каждого Строка Из ОсновнойДокумент.ДокументыОснования Цикл
		СписокДокументовОснований.Добавить(Строка.ДокументОснование);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеДокументов()

	ЗаполнитьСписокДокументовОснований(Объект.ОсновнойДокумент);

	УсловноеОформление.Элементы.Очистить();

	// Зелёный фон, если основной документ присутствует в списке документов-оснований.
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ОсновныеДокументыОсновнойДок");

	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОсновныеДокументы.ОсновнойДок");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение = СписокДокументовОснований;

	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноЗеленый);

	// Красный фон площади по документу, если она не совпадает с площадью объекта.
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ОсновныеДокументыПлощадьПоДокументу");

	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОсновныеДокументы.ПлощадьПоДокументу");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение = Объект.Площадь;

	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Лосось);
	
	// Зелёный фон, если дополнительный документ присутствует в списке документов-оснований.
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДополнительныеДокументыДополнительныйДок");

	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ДополнительныеДокументы.ДополнительныйДок");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение = СписокДокументовОснований;

	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноЗеленый);

	// Красный фон площади по документу, если она не совпадает с площадью объекта.
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДополнительныеДокументыПлощадьПоДокументу");

	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ДополнительныеДокументы.ПлощадьПоДокументу");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение = Объект.Площадь;

	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Лосось);

КонецПроцедуры


&НаСервере
Процедура КадастровыйНомерПриИзмененииНаСервере()

	Объект.КадастровыйНомер = СокрЛП(Объект.КадастровыйНомер);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ОткрытьНедвижимостьПоКННаСервере(КадастровыйНомер)

	Возврат трс_ОперацииНедвижимости.ПолучитьНедвижимостьПоКН(СокрЛП(КадастровыйНомер));

КонецФункции

#КонецОбласти
